davidanson.vscode-markdownlint
foxundermoon.shell-format
github.copilot
github.copilot-chat
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode.remote-explorer
ms-vsliveshare.vsliveshare
pshaddel.conventional-branch
streetsidesoftware.code-spell-checker
vivaxy.vscode-conventional-commits
yzhang.markdown-all-in-one